#+NAME: my-table
| first name  | last name | yearly-income |
|-------------+-----------+---------------|
| Mr          | Bennett   |          2000 |
| Fitzwilliam | Darcy     |         10000 |
| Charles     | Bingley   |          5000 |

#+BEGIN_SRC emacs-lisp :var table=my-table
  (-map
   (lambda (row)
	 (cl-destructuring-bind (first last income) row
	   (list
		(format "Mr. %s is a man of %s fortune; %s a year."
				last
				(if (< income 2500) "small" "large")
				income))))
   table)
#+END_SRC

#+RESULTS:
| Mr. Bennett is a man of small fortune; 2000 a year. |
| Mr. Darcy is a man of large fortune; 10000 a year.  |
| Mr. Bingley is a man of large fortune; 5000 a year. |
